Merge branch 'main' into feat/typed_slots
# Conflicts:
#	packages/compiler-sfc/src/cssVars.ts
#	packages/dts-test/defineComponent.test-d.tsx
#	packages/runtime-core/src/apiDefineComponent.ts
#	packages/runtime-core/src/component.ts
#	packages/runtime-core/src/componentOptions.ts
#	packages/runtime-core/src/componentPublicInstance.ts
#	packages/runtime-core/src/scheduler.ts
